## 10.1 GroupBy Mechanics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.597686
b    0.141929
Name: data1, dtype: float64

In [7]:
grouped2 = df['data2'].groupby(df['key2'])

In [8]:
grouped2.mean()

key2
one   -0.215131
two    0.387497
Name: data2, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -1.077356
      two     0.361653
b     one    -0.001405
      two     0.285263
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -1.077356  0.361653
b    -0.001405  0.285263

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005    0.361653
            2006   -0.001405
Ohio        2005   -0.255912
            2006   -1.357625
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.597686  0.031625
b     0.141929  0.017364

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.077356 -0.147927
     two   0.361653  0.390727
b    one  -0.001405 -0.349539
     two   0.285263  0.384267

In [17]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [18]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### Iterating Over Groups

In [19]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
4    a  one -1.357625 -0.100950
b
  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267

In [20]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
4    a  one -1.357625 -0.100950
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.361653  0.390727
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.285263  0.384267

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267

In [23]:
pieces['a']

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
4    a  one -1.357625 -0.100950

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [26]:
grouped

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.797087 -0.194903
1  0.361653  0.390727
2 -0.001405 -0.349539
3  0.285263  0.384267
4 -1.357625 -0.100950
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Select a Column or Subset of Columns

In [28]:
df.groupby('key1')['data1']

In [29]:
df.groupby('key1')[['data2']]

In [30]:
df['data1'].groupby(df['key1'])

In [31]:
df[['data2']].groupby(df['key1'])

In [32]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.147927
     two   0.390727
b    one  -0.349539
     two   0.384267

In [33]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [34]:
s_grouped

In [35]:
s_grouped.mean()

key1  key2
a     one    -0.147927
      two     0.390727
b     one    -0.349539
      two     0.384267
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [36]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [37]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [38]:
people

               a         b         c         d         e
Joe     0.683157  0.631199 -1.377416 -0.202835 -0.277532
Steve   0.585750  0.217250 -0.046256 -0.317634  0.406377
Wes     0.066338       NaN       NaN -0.229374  0.011357
Jim     0.594821  0.287191  0.515219 -1.145414 -0.515954
Travis  0.133309  0.570878  0.367237  0.871120  1.262539

In [39]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 
           'd': 'blue', 'e': 'red', 'f':'orange'}

In [40]:
by_column = people.groupby(mapping, axis=1)

In [41]:
by_column.sum()

            blue       red
Joe    -1.580251  1.036824
Steve  -0.363890  1.209377
Wes    -0.229374  0.077696
Jim    -0.630196  0.366059
Travis  1.238357  1.966726

In [42]:
map_series = pd.Series(mapping)

In [43]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [44]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [45]:
people.groupby(map_series, axis=1).mean()

            blue       red
Joe    -0.790125  0.345608
Steve  -0.181945  0.403126
Wes    -0.229374  0.038848
Jim    -0.315098  0.122020
Travis  0.619178  0.655575

### Grouping with Functions

In [46]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.344317  0.918391 -0.862197 -1.577623 -0.782128
5  0.585750  0.217250 -0.046256 -0.317634  0.406377
6  0.133309  0.570878  0.367237  0.871120  1.262539

In [47]:
people

               a         b         c         d         e
Joe     0.683157  0.631199 -1.377416 -0.202835 -0.277532
Steve   0.585750  0.217250 -0.046256 -0.317634  0.406377
Wes     0.066338       NaN       NaN -0.229374  0.011357
Jim     0.594821  0.287191  0.515219 -1.145414 -0.515954
Travis  0.133309  0.570878  0.367237  0.871120  1.262539

In [48]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [49]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.066338  0.631199 -1.377416 -0.229374 -0.277532
  two  0.594821  0.287191  0.515219 -1.145414 -0.515954
5 one  0.585750  0.217250 -0.046256 -0.317634  0.406377
6 two  0.133309  0.570878  0.367237  0.871120  1.262539

### Grouping by Index Levels

In [50]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [51]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [52]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [53]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.924563  1.317659 -3.020106  2.356310  0.756303
1      0.637641 -0.109088 -0.526210 -0.122377 -1.265956
2     -0.799849 -0.408841  1.228000  1.200175  0.237341
3     -1.413123  1.209267 -0.298955 -0.515657  0.982154

In [54]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2 Data Aggregation

In [55]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [56]:
grouped = df.groupby('key1')

In [60]:
grouped['data1'].nsmallest(2)

key1
a     4   -1.357625
      0   -0.797087
b     2   -0.001405
      3    0.285263
Name: data1, dtype: float64

In [58]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [59]:
grouped.agg(peak_to_peak)

/var/folders/jf/gt_0n5l11fb60xg7lyjrbvbw0000gn/T/ipykernel_93667/4193407341.py:1: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.719278  0.585630
b     0.286668  0.733806

In [61]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.597686  0.876812 -1.357625 -1.077356 -0.797087 -0.217717
b      2.0  0.141929  0.202705 -0.001405  0.070262  0.141929  0.213596

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.361653   3.0  0.031625  0.314520 -0.194903 -0.147927 -0.100950
b     0.285263   2.0  0.017364  0.518879 -0.349539 -0.166087  0.017364


           75%       max
key1
a     0.144888  0.390727
b     0.200816  0.384267

### Column-Wise and Multiple Function Application

In [62]:
tips = pd.read_csv("examples/tips.csv")

In [63]:
tips

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [64]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [65]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [66]:
grouped = tips.groupby(['day', 'smoker'])

In [67]:
grouped_pct = grouped['tip_pct']

In [68]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [69]:
grouped.mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

In [71]:
grouped_pct.mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [72]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [73]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [74]:
functions = ['count', 'mean', 'max']

In [77]:
result = grouped[['tip_pct', 'total_bill']].agg(functions)

In [78]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [79]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [80]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [82]:
grouped[['tip_pct', 'total_bill']].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [83]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [84]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### Returning Aggregated Data Without Row Indexes

In [85]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## 10.3 Apply: General split-apply-combine

In [86]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [87]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [88]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [89]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [90]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [91]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [92]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [93]:
f = lambda x: x.describe()
group.apply(f)

       key1 key2
count     5    5
unique    2    2
top       a  one
freq      3    3

### Suppressing the Group Keys

In [94]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

### Quantile and Bucket Analysis

In [95]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [97]:
quartiles = pd.cut(frame.data1, 4)

In [98]:
quartiles[:10]

0     (-0.179, 1.634]
1      (1.634, 3.447]
2     (-0.179, 1.634]
3      (1.634, 3.447]
4    (-1.993, -0.179]
5     (-0.179, 1.634]
6     (-0.179, 1.634]
7     (-0.179, 1.634]
8     (-0.179, 1.634]
9    (-1.993, -0.179]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.813, -1.993] < (-1.993, -0.179] < (-0.179, 1.634] < (1.634, 3.447]]

In [99]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [100]:
grouped = frame.data2.groupby(quartiles)

In [101]:
grouped

In [102]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.813, -1.993] -2.709209  2.328016   24.0  0.203713
(-1.993, -0.179] -3.418967  3.175317  428.0  0.046882
(-0.179, 1.634]  -3.042298  3.092548  490.0  0.000613
(1.634, 3.447]   -2.298083  2.008002   58.0  0.052998

In [103]:
# Return quantile numbers
grouping = pd.qcut(frame.data1, 10, labels=False)

In [104]:
grouped = frame.data2.groupby(grouping)

In [105]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -3.418967  2.328016  100.0  0.029366
1     -1.738270  2.345404  100.0  0.130972
2     -2.120412  3.175317  100.0  0.110537
3     -2.144764  2.669298  100.0 -0.040836
4     -2.752618  2.705808  100.0  0.190958
5     -2.384969  3.092548  100.0 -0.008345
6     -3.042298  2.083032  100.0  0.030122
7     -1.940121  2.160013  100.0 -0.075206
8     -2.359957  2.009978  100.0 -0.116392
9     -2.298083  2.008002  100.0  0.032113

### Example: Filing Missing Values with Group-Specific Values

In [106]:
s = pd.Series(np.random.randn(6))

In [107]:
s[::2] = np.nan

In [108]:
s

0         NaN
1   -0.877388
2         NaN
3    0.296141
4         NaN
5    1.378125
dtype: float64

In [109]:
s.fillna(s.mean())

0    0.265626
1   -0.877388
2    0.265626
3    0.296141
4    0.265626
5    1.378125
dtype: float64

In [110]:
s

0         NaN
1   -0.877388
2         NaN
3    0.296141
4         NaN
5    1.378125
dtype: float64

In [112]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 
          'Oregon', 'Nevada', 'California', 'Idaho']

In [113]:
group_key = ['East'] * 4 + ['West'] * 4

In [114]:
data = pd.Series(np.random.randn(8), index=states)

In [115]:
data

Ohio          0.554250
New York     -0.102162
Vermont      -0.087551
Florida       2.186144
Oregon        0.133749
Nevada       -1.142958
California    0.207622
Idaho        -0.112528
dtype: float64

In [116]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [117]:
data

Ohio          0.554250
New York     -0.102162
Vermont            NaN
Florida       2.186144
Oregon        0.133749
Nevada             NaN
California    0.207622
Idaho              NaN
dtype: float64

In [118]:
data.groupby(group_key).mean()

East    0.879411
West    0.170685
dtype: float64

In [119]:
fill_mean = lambda g: g.fillna(g.mean())

In [120]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.554250
New York     -0.102162
Vermont       0.879411
Florida       2.186144
Oregon        0.133749
Nevada        0.170685
California    0.207622
Idaho         0.170685
dtype: float64

In [121]:
fill_values = {'East': 0.5, 'West': -1}

In [124]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [125]:
data.groupby(group_key).apply(fill_func)

Ohio          0.554250
New York     -0.102162
Vermont       0.500000
Florida       2.186144
Oregon        0.133749
Nevada       -1.000000
California    0.207622
Idaho        -1.000000
dtype: float64

### Example: Random Sampling and Permutation

In [128]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) *4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [129]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [130]:
def draw(deck, n=5):
    return deck.sample(n)

In [131]:
draw(deck)

3H     3
3D     3
2D     2
QC    10
9D     9
dtype: int64

In [132]:
get_suit = lambda card: card[-1]

In [133]:
deck.groupby(get_suit).apply(draw, n=2)

C  JC    10
   7C     7
D  6D     6
   AD     1
H  7H     7
   AH     1
S  7S     7
   8S     8
dtype: int64

In [134]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

QC    10
6C     6
JD    10
4D     4
JH    10
2H     2
4S     4
JS    10
dtype: int64

### Example: Group Weighted Average and Correlation

In [136]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a', 
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [137]:
df

  category      data   weights
0        a -0.529907  0.082551
1        a -0.195646  0.975758
2        a  0.839218  0.676144
3        a  0.454476  0.573852
4        b  0.227369  0.239327
5        b  0.904373  0.111074
6        b -1.004672  0.551091
7        b  0.754609  0.195056

In [138]:
grouped = df.groupby('category')

In [139]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [141]:
grouped.apply(get_wavg)

category
a    0.257153
b   -0.229453
dtype: float64

In [142]:
close_px = pd.read_csv("examples/stock_px_2.csv", parse_dates=True, index_col=0)

In [143]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [144]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [145]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [146]:
rets = close_px.pct_change().dropna()

In [147]:
get_year = lambda x: x.year

In [148]:
by_year = rets.groupby(get_year)

In [149]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [150]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

### Example: Group-Wise Linear Regression

In [151]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1
    result = sm.OLS(Y, X).fit()
    return result.params

In [152]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514